import pymongo

client = pymongo.MongoClient("mongodb+srv://catfood_db:<password>@cluster0.rvn03z4.mongodb.net/?retryWrites=true&w=majority")
mydb = client["catfood_db"]
mycol = mydb["catfood_db"]

Feline_Natural_list =[
    {"_id": "2_a", "品牌": "Feline Natural 鮮嫩", "口味": "雞", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "38.4", "脂肪": "61.6", "碳水": "0", "磷含量": "494", "鈣磷比": "1.4:1",
     "是否含膠": "無",
     "成分表": "雞肉,紐西蘭純水,雞肝,紐西蘭綠唇貝魚油,亞麻籽,乾海藻,鹽,牛磺酸,氯化膽鹼"
            ",維生素E, 氧化鎂,鋅蛋白,銅蛋白 錳蛋白,維生素B1,維生素D3,葉酸"},
    {"_id": "2_b", "品牌": "Feline Natural 鮮嫩", "口味": "牛", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "29", "脂肪": "71", "碳水": "0", "磷含量": "356", "鈣磷比": "1.8:1", "是否含膠": "無",
     "成分表": "牛肉,紐西蘭純水,牛肚,牛心,牛臀,牛牌,牛肝,牛血,紐西蘭綠唇貝魚油亞麻籽片,葵花籽油,硫酸鉀,乾海藻"
            ",鹽,牛磺 酸,維生素E,氧化鎂,鋅蛋白,銅蛋白,錳蛋白,維生素B1,維生素D3, 葉酸"},
    {"_id": "2_c", "品牌": "Feline Natural 鮮嫩", "口味": "羊", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "28.8", "脂肪": "71.2", "碳水": "0", "磷含量": "248", "鈣磷比": "1.7:1", "是否含膠": "無",
     "成分表": "羊肉紐西蘭純水,羊肚,羊心,羊腎,羊牌,羊肝羊血,磨碎羊骨,紐西蘭綠唇貝魚油亞麻籽片,"
            "硫酸鉀,乾海藻,鹽,牛磺 酸,維生素E, 氧化鎂,鋅蛋白,銅蛋白錳蛋白維生素B1,維生素D3,葉酸"},
    {"_id": "2_d", "品牌": "Feline Natural 鮮嫩", "口味": "雞+羊", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "36.9", "脂肪": "62.7", "碳水": "0.4", "磷含量": "335", "鈣磷比": "1.3:1", "是否含膠": "無",
     "成分表": "雞肉.羊心,紐西蘭純水,羊腎,羊肝羊血,亞麻籽殼,紐西蘭綠唇貝乾海藻,牛磺酸,維生素E, 氧化鎂,鋅蛋白"
            ",銅蛋白,錳蛋白,維生素B1,維生素D3, 葉酸"},
    {"_id": "2_e", "品牌": "Feline Natural 鮮嫩", "口味": "雞+鹿", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "41.7", "脂肪": "58", "碳水": "0.4", "磷含量": "464", "鈣磷比": "1.8:1", "是否含膠": "無",
     "成分表": "雞肉,雞心,紐西蘭純水,鹿肾,鹿肝,鹿血,亞麻籽殼,紐西蘭綠唇貝乾海藻,牛磺酸,維生素E, "
            "氧化鎂,鋅蛋白,銅蛋白, 錳蛋白,維生素B1,維生素D3, 葉酸"},
    {"_id": "2_f", "品牌": "Feline Natural 鮮嫩", "口味": "牛+鱈魚", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "32", "脂肪": "61.7", "碳水": "6.3", "磷含量": "423", "鈣磷比": "2:1", "是否含膠": "無",
     "成分表": "牛心,紐西蘭純水魚,牛肉,牛臀,牛肚,牛血,葵花籽油,亞麻籽殼,紐西蘭綠唇貝,碳酸鈣,"
            "碳酸鉀,乾海藻,牛磺酸, 維生素E, 氧化鎂,鋅蛋白,銅蛋白,錳蛋白,維生素B1,維生素D3, 葉酸"},
    {"_id": "2_g", "品牌": "Feline Natural 鮮嫩", "口味": "羊+鮭魚", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "33.5", "脂肪": "64.5", "碳水": "2", "磷含量": "189", "鈣磷比": "1.5:1", "是否含膠": "無",
     "成分表": "羊心,紐西蘭純水,鮮魚,羊肾羊肝羊血,亞麻籽設紐西蘭綠唇貝,碳酸鈣,碳酸鈣,乾海藻,牛磺酸,維生素E, "
            "氧化 鎂,鋅蛋白,銅蛋白錳蛋白,維生素B1,維生素D3, 葉酸"}

]


mycol.insert_many(Feline_Natural_list)