import pymongo

client = pymongo.MongoClient("mongodb+srv://catfood_db:passwordtest@cluster0.rvn03z4.mongodb.net/?retryWrites=true&w=majority")
mydb = client["catfood_db"]
mycol = mydb["catfood_db"]

Instinct_list =[
    {"_id": "4_a", "品牌": "Instinct 原點", "口味": "雞", "產地": "美國", "主食罐/副食罐": "主食罐",
     "蛋白": "34.5", "脂肪": "62.9", "碳水": "2.6", "磷含量": "266", "鈣磷比": "1.5:1",
     "是否含膠": "無", "其他": "豌豆",
     "成分表": "雞肉，牛肝，雞湯，三文魚（DHA來源），雞蛋，蒙脫土，海帶乾，牛磺酸，氯化鉀，鹽，礦物質（鐵蛋白，鋅蛋白，銅蛋白，錳蛋白，亞硒酸鈉，碘化鉀） ，氯化膽鹼，維生素（維生素E補充劑，一硝酸硫胺素，菸酸補充劑，泛酸d-鈣，吡P醇鹽酸鹽，核黃素補充劑，維生素A補充劑，生物素，維生素D3補充劑，維生素B12補充劑，葉酸），"
            "L-抗壞血酸-2 -聚磷酸鹽，朝鮮薊，蔓越莓，南瓜，番茄，藍莓，西蘭花，捲心菜，羽衣甘藍，歐芹。"},
    {"_id": "4_b", "品牌": "Instinct 原點", "口味": "鴨", "產地": "美國", "主食罐/副食罐": "主食罐",
     "蛋白": "34.1", "脂肪": "64.5", "碳水": "1.4", "磷含量": "280", "鈣磷比": "1.6:1",
     "是否含膠": "無", "其他": "豌豆",
     "成分表": "鴨肉，火雞肝，鴨湯，研磨亞麻籽，蒙脫石粘土（協助吸附黴菌和有害細菌，加強粘膜保護），豌豆，氯化鉀，紅蘿蔔，鹽，礦物質（鐵蛋白鹽，鋅蛋白鹽，銅蛋白鹽，錳蛋白鹽，亞硒酸鈉，碘化鉀），氯化膽鹼，"
            "維生素群（維生素E，維生素B1，維生素B3，維生素B5，維生素B6，維生素B2，維生素A，維生素B7，維生素D3，維生素B12，維生素B9），牛磺酸，"
            "L-抗壞血酸-2-多聚磷酸鹽，油鯡魚油（以維生素E保存），朝鮮薊，蔓越莓，南瓜，番茄，藍莓，"
            "花椰菜，甘藍，羽衣甘藍，荷蘭芹。"},
    {"_id": "4_c", "品牌": "Instinct 原點", "口味": "羊", "產地": "美國", "主食罐/副食罐": "主食罐",
     "蛋白": "31", "脂肪": "67.8", "碳水": "1.1", "磷含量": "234", "鈣磷比": "1.5:1",
     "是否含膠": "無", "其他": "豌豆",
     "成分表": "羊肉，羊湯，火雞肉，火雞肝，研磨亞麻籽，蒙脫石粘土（協助吸附黴菌和有害細菌，加強粘膜保護），全蛋，豌豆，紅蘿蔔，氯化鉀，鹽，礦物質（鐵蛋白鹽，鋅蛋白鹽，銅蛋白鹽，錳蛋白鹽，亞硒酸鈉，碘化鉀），氯化膽鹼，維生素群（維生素E，維生素B1，維生素B3，維生素B5，維生素B6，維生素B2，維生素A，維生素B7，維生素D3，維生素B12，維生素B9），"
            "牛磺酸，L-抗壞血酸-2-多聚磷酸鹽，油鯡魚油（以維生素E保存），朝鮮薊，蔓越莓，南瓜，番茄，藍莓，花椰菜，"
            "甘藍，羽衣甘藍，荷蘭芹。"},
    {"_id": "4_d", "品牌": "Instinct 原點", "口味": "鹿", "產地": "美國", "主食罐/副食罐": "主食罐",
     "蛋白": "43", "脂肪": "56.2", "碳水": "0.8", "磷含量": "368", "鈣磷比": "1.6:1",
     "是否含膠": "無", "其他": "豌豆",
     "成分表": "鹿肉，豬肝，豬湯，研磨亞麻籽，蒙脫石粘土（協助吸附黴菌和有害細菌，加強粘膜保護），豌豆，紅蘿蔔，氯化鉀，礦物質（鐵蛋白鹽，鋅蛋白鹽，銅蛋白鹽，錳蛋白鹽，亞硒酸鈉，碘化鉀），氯化膽鹼，油鯡魚油（以維生素E保存），維生素群（維生素E，維生素B1，維生素B3，維生素B5，維生素B6，維生素B2，維生素A，維生素B7，維生素D3，維生素B12，維生素B9），"
            "牛磺酸，鹽，L-抗壞血酸-2-多聚磷酸鹽，朝鮮薊，蔓越莓，南瓜，番茄，藍莓，花椰菜，甘藍，羽衣甘藍，荷蘭芹。"},
    {"_id": "4_e", "品牌": "Instinct 原點", "口味": "鮭魚", "產地": "美國", "主食罐/副食罐": "主食罐",
     "蛋白": "50.5", "脂肪": "46.7", "碳水": "2.8", "磷含量": "369", "鈣磷比": "1.4:1",
     "是否含膠": "無", "其他": "豌豆",
     "成分表": "鮭魚，鮭魚湯，豬肝，研磨亞麻籽，蒙脫石粘土（協助吸附黴菌和有害細菌，加強粘膜保護），蛋製品，豌豆，紅蘿蔔，氯化鉀，鹽，礦物質（鐵蛋白鹽，鋅蛋白鹽，銅蛋白鹽，錳蛋白鹽，亞硒酸鈉，碘化鉀），氯化膽鹼，維生素群（維生素B1，維生素E，維生素B3，維生素B5，維生素B6，維生素B2，維生素A，維生素B7，維生素D3，維生素B12，維生素B9），"
            "牛磺酸，L-抗壞血酸-2-多聚磷酸鹽，朝鮮薊，蔓越莓，南瓜，番茄，藍莓，花椰菜，甘藍，羽衣甘藍，荷蘭芹。"},
    {"_id": "4_f", "品牌": "Instinct 原點", "口味": "皇極-雞", "產地": "美國", "主食罐/副食罐": "主食罐",
     "蛋白": "34.5", "脂肪": "62.9", "碳水": "2.6", "磷含量": "266", "鈣磷比": "1.5:1",
     "是否含膠": "無", "其他": "豌豆",
     "成分表": "雞肉，火雞肉，雞肝，雞湯，研磨亞麻籽，蒙脫石粘土（協助吸附黴菌和有害細菌，加強粘膜保護），全蛋，豌豆，紅蘿蔔，氯化鉀，鹽，礦物質（鐵蛋白鹽，鋅蛋白鹽，銅蛋白鹽，錳蛋白鹽，亞硒酸鈉，碘化鉀），氯化膽鹼，維生素群（維生素E，維生素B1，維生素B3，維生素B5，維生素B6，維生素B2，維生素A，維生素B7，維生素D3，維生素B12，維生素B9），"
            "牛磺酸，L-抗壞血酸-2-多聚磷酸鹽，油鯡魚油（以維生素E保存），朝鮮薊，蔓越莓，南瓜，番茄，藍莓，花椰菜，"
            "甘藍，羽衣甘藍，荷蘭芹。"},
    {"_id": "4_g", "品牌": "Instinct 原點", "口味": "低敏-火雞", "產地": "美國", "主食罐/副食罐": "主食罐",
     "蛋白": "38.3", "脂肪": "56.6", "碳水": "5.2", "磷含量": "245", "鈣磷比": "1.6:1",
     "是否含膠": "無", "其他": "豌豆",
     "成分表": "火雞肉，火雞湯，火雞肝，豌豆，豌豆蛋白質，蒙脫石粘土（協助吸附黴菌和有害細菌，加強粘膜保護），氯化鉀，礦物質（鐵蛋白鹽，鋅蛋白鹽，銅蛋白鹽，錳蛋白鹽，亞硒酸鈉，碘化鉀），鹽，氯化膽鹼，維生素群（維生素E，維生素B1，維生素B3，維生素B5，維生素B6，維生素B2，維生素A，維生素B7，維生素D3，維生素B12，維生素B9），"
            "牛磺酸，L-抗壞血酸-2-多聚磷酸鹽。"}
]

mycol.insert_many(Instinct_list)