import pymongo

client = pymongo.MongoClient("mongodb+srv://catfood_db:<password>@cluster0.rvn03z4.mongodb.net/?retryWrites=true&w=majority")
mydb = client["catfood_db"]
mycol = mydb["catfood_db"]

Zealandia_list = [
    {"_id": "3_a", "品牌": "Feline Natural 鮮嫩", "口味": "雞", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "42.4", "脂肪": "54.2", "碳水": "3.3", "磷含量": "260", "鈣磷比": "1.9:1",
     "是否含膠": "決明子、洋菜膠、瓜爾膠",
     "成分表": "去骨雞，足夠加工的水，羊肝，羊肺，羊綠肚，羊心，羊腎，新西蘭青貽貝，幹酵母，胡蘿蔔，決明子膠，瓊脂，瓊脂，鮭魚油，碳酸鈣，瓜爾膠，"
            "氯化鉀，氯化膽鹼，牛磺酸，蛋白質鐵，甘氨酸鋅複合物，菸酸補充劑，α-生育酚乙酸酯，硒酵母，錳酸錳，"
            "甘氨酸銅複合物，硫胺素硝酸鹽，泛酸鈣，核黃素，鹽酸吡ox醇，生物鹼，維生素A醋酸鹽維生素B12補充劑，碘酸鈣，"
            "葉酸，膽鈣化固醇。"},
    {"_id": "3_b", "品牌": "Feline Natural 鮮嫩", "口味": "鴨", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "36.7", "脂肪": "54.7", "碳水": "8.5", "磷含量": "324", "鈣磷比": "1.9:1",
     "是否含膠": "決明子、洋菜膠、瓜爾膠",
     "成分表": "去骨鴨，足夠加工用水，羊肝，羊肺，羊綠肚，羊心，羊腎，新西蘭綠貽貝，幹酵母，胡蘿蔔，決明子膠，瓊脂，鮭魚油，碳酸鈣，瓜爾膠，氯化鉀，氯化膽鹼，"
            "牛磺酸，鐵蛋白酸鹽，甘氨酸鋅複合物，菸酸補充劑，α-生育酚乙酸酯，硒酵母，錳錳酸鹽，甘氨酸銅絡合物，"
            "硫胺素硝酸鹽，泛酸鈣，核黃素，鹽酸吡ox醇，生物鹼，維生素A醋酸鹽維生素B12補充劑，碘酸鈣，葉酸，膽鈣化固醇。"},
    {"_id": "3_c", "品牌": "Feline Natural 鮮嫩", "口味": "牛", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "35.2", "脂肪": "61.7", "碳水": "3.1", "磷含量": "264", "鈣磷比": "2:1",
     "是否含膠": "決明子、洋菜膠、瓜爾膠",
     "成分表": "去骨牛肉，足夠加工的水，羊肝，羊肺，羊綠肚，羊心，羊腎，新西蘭綠貽貝，幹酵母，胡蘿蔔，決明子膠，瓊脂，鮭魚油，碳酸鈣，瓜爾膠，氯化鉀，氯化膽鹼，牛磺酸，蛋白質鐵，"
            "甘氨酸鋅複合物，菸酸補充劑，α-生育酚乙酸酯，硒酵母，錳酸錳，甘氨酸銅複合物，硫胺素硝酸鹽，"
            "泛酸鈣，核黃素，鹽酸吡ox醇，生物鹼，維生素A醋酸鹽維生素B12補充劑，碘酸鈣，葉酸，膽鈣化固醇。"},

    {"_id": "3_d", "品牌": "Feline Natural 鮮嫩", "口味": "羊", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "25.4", "脂肪": "71.1", "碳水": "3.6", "磷含量": "193", "鈣磷比": "2.1:1",
     "是否含膠": "決明子、洋菜膠、瓜爾膠",
     "成分表": "去骨羊肉，加工用水充足，羊肝，羊肺，羊綠肚，羊心，羊腎，新西蘭綠貽貝，幹酵母，胡蘿蔔，決明子膠，瓊脂，鮭魚油，碳酸鈣，瓜爾膠，氯化鉀，氯化膽鹼，牛磺酸，"
            "蛋白質鐵，甘氨酸鋅複合物，菸酸補充劑，α-生育酚乙酸酯，硒酵母，錳酸錳，甘氨酸銅複合物，硫胺素硝酸鹽，泛酸鈣，"
            "核黃素，鹽酸吡ox醇，生物鹼，維生素A維生素B12補充劑，碘酸鈣，葉酸，膽鈣化固醇。"},
   {"_id": "3_e", "品牌": "Feline Natural 鮮嫩", "口味": "鮭魚", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "27.4", "脂肪": "67.4", "碳水": "5.2", "磷含量": "231", "鈣磷比": "2:1",
     "是否含膠": "決明子、洋菜膠、瓜爾膠",
     "成分表": "去骨三文魚，足夠加工的水，羊肝，羊肺，羊綠肚，羊心，羊腎，新西蘭綠貽貝，幹酵母，胡蘿蔔，決明子膠，瓊脂，鮭魚油，碳酸鈣，瓜爾膠，氯化鉀，氯化膽鹼，牛磺酸，鐵蛋白酸鹽，"
            "甘氨酸鋅複合物，菸酸補充劑，α-生育酚乙酸酯，硒酵母，錳錳酸鹽，甘氨酸銅絡合物，硫胺素硝酸鹽，"
            "泛酸鈣，核黃素，鹽酸吡ox醇，生物鹼，維生素A醋酸鹽維生素B12補充劑，碘酸鈣，葉酸，膽鈣化固醇。"},
    {"_id": "3_f", "品牌": "Feline Natural 鮮嫩", "口味": "鱈魚", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "55.1", "脂肪": "43.1", "碳水": "1.8", "磷含量": "135", "鈣磷比": "1.5:1",
     "是否含膠": "決明子、洋菜膠、瓜爾膠",
     "成分表": "去骨厚皮魚，可加工的水，羊肝，羊肺，羊綠肚，羊心，羊腎，新西蘭綠貽貝，幹酵母，胡蘿蔔，決明子膠，瓊脂，鮭魚油，碳酸鈣，瓜爾膠，氯化鉀，氯化膽鹼，牛磺酸，"
            "鐵蛋白酸鹽，甘氨酸鋅絡合物，菸酸補充劑，α-生育酚乙酸酯，硒酵母，錳錳酸鹽，甘氨酸銅絡合物，"
            "硫胺素硝酸鹽，泛酸鈣，核黃素，吡rid醇鹽酸鹽，維生素A醋酸鹽，維生素B12補充劑，碘酸鈣，葉酸，膽鈣化固醇。"},
    {"_id": "3_g", "品牌": "Feline Natural 鮮嫩", "口味": "山羊", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "48.9", "脂肪": "43.2", "碳水": "8", "磷含量": "179", "鈣磷比": "1.8:1",
     "是否含膠": "決明子、洋菜膠、瓜爾膠",
     "成分表": "去骨山羊，加工用水充足，羊肝，羊肺，羊綠肚，羊心，羊腎，新西蘭綠貽貝，幹酵母，胡蘿蔔，決明子膠，瓊脂，瓊脂，鮭魚油，碳酸鈣，瓜爾膠，氯化鉀，氯化膽鹼，牛磺酸，蛋白質鐵，"
            "甘氨酸鋅複合物，菸酸補充劑，α-生育酚乙酸酯，硒酵母，錳酸錳，甘氨酸銅複合物，硫胺素硝酸鹽，泛酸鈣，"
            "核黃素，鹽酸吡ox醇，生物鹼，維生素A醋酸鹽維生素B12補充劑，碘酸鈣，葉酸，膽鈣化固醇。"},
    {"_id": "3_h", "品牌": "Feline Natural 鮮嫩", "口味": "鹿", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "55", "脂肪": "35.1", "碳水": "9.9", "磷含量": "208", "鈣磷比": "1.8:1",
     "是否含膠": "決明子、洋菜膠、瓜爾膠",
     "成分表": "去骨鹿肉，加工用水充足，羊肝，羊肺，羊綠肚，羊心，羊腎，新西蘭綠貽貝，幹酵母，胡蘿蔔，決明子膠，瓊脂，瓊脂，鮭魚油，碳酸鈣，瓜爾膠，氯化鉀，氯化膽鹼，牛磺酸，鐵蛋白酸鹽，甘氨酸鋅複合物，"
            "菸酸補充劑，α-生育酚乙酸酯，硒酵母，錳錳酸鹽，甘氨酸銅絡合物，硫胺素硝酸鹽，泛酸鈣，核黃素，鹽酸吡ox醇，"
            "生物鹼，維生素A醋酸鹽維生素B12補充劑，碘酸鈣，葉酸，膽鈣化固醇。"},
    {"_id": "3_i", "品牌": "Feline Natural 鮮嫩", "口味": "袋鼠", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "55.3", "脂肪": "34.1", "碳水": "10.5", "磷含量": "166", "鈣磷比": "1.5:1",
     "是否含膠": "決明子、洋菜膠、瓜爾膠",
     "成分表": "去骨袋鼠，加工用水充足，羊肝，羊肺，羊綠肚，羊心，羊腎，新西蘭綠貽貝，幹酵母，胡蘿蔔，決明子膠，瓊脂，瓊脂，鮭魚油，碳酸鈣，瓜爾膠，氯化鉀，氯化膽鹼，牛磺酸，"
            "蛋白質鐵，甘氨酸鋅複合物，菸酸補充劑，α-生育酚乙酸酯，硒酵母，錳酸錳，甘氨酸銅複合物，"
            "硫胺素硝酸鹽，泛酸鈣，核黃素，鹽酸吡ox醇，生物鹼，維生素A醋酸鹽維生素B12補充劑，碘酸鈣，葉酸，膽鈣化固醇。"},
    {"_id": "3_j", "品牌": "Feline Natural 鮮嫩", "口味": "狐袋鼬", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "51.6", "脂肪": "44.3", "碳水": "4.1", "磷含量": "249", "鈣磷比": "1.7:1",
     "是否含膠": "決明子、洋菜膠、瓜爾膠",
     "成分表": "去骨山羊肉、水、羊內臟（羊肝、羊肺、羊綠草胃、羊心、羊腎）、綠唇貽貝、乾燥酵母、決明子膠、胡蘿蔔纖維、鮭魚油、碳酸鈣、洋菜膠、瓜爾豆膠、氯化鉀、氯化膽鹼、牛磺酸、鐵蛋白、"
            "甘氨酸鋅複合物、維生素B3、維生素E、亞硒酸鈉、錳蛋白、甘氨酸銅複合物、維生素B1、維生素B5、維生素B2、"
            "維生素B6、維生素A醋酸鹽、生物素、維生素B12補充劑、碘酸鈣、葉酸、維生素D3。"}
]

myquery = {"品牌":"Feline Natural 鮮嫩"}
new = {"$set": {"品牌": "Zealandia 狂野天廚"}}
mycol.update_many(myquery, new)