import pymongo

client = pymongo.MongoClient("mongodb+srv://catfood_db:passwordtest@cluster0.rvn03z4.mongodb.net/?retryWrites=true&w=majority")
mydb = client["catfood_db"]
mycol = mydb["catfood_db"]

ziwi_peak_list = [
    {"_id": "1_a", "品牌": "Ziwi peak巔峰", "口味": "雞", "產地": "紐西蘭","主食罐/副食罐": "主食罐",
     "蛋白": "33.9", "脂肪": "54.8", "碳水": "11.3", "磷含量": "287", "鈣磷比": "1.2:1",
     "是否含膠": "無", "其他": "鷹嘴豆", "成分表": "雞肉、雞肝、雞心、紐西蘭青口、雞骨、卵磷脂、菊苣中的菊粉、海帶乾、"
                                      "礦物質 (磷酸二鉀、硫酸鎂、鋅胺基酸絡合物、銅胺基酸絡合物、鐵胺基酸絡合物、錳胺基酸酸複合物、亞硒酸鈉)、鹽、"
                                      "防腐劑 (檸檬酸、混合生育酚)、維他命 (氯化膽鹼、硫胺素、鹽酸吡哆醇、葉酸、維他命 D3 補充劑)、DL-蛋氨酸、牛磺酸"},
    {"_id": "1_b", "品牌": "Ziwi peak巔峰", "口味": "牛", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "34.4", "脂肪": "53.1", "碳水": "12.5", "磷含量": "280", "鈣磷比": "1.4:1",
     "是否含膠": "無", "其他": "鷹嘴豆",
     "成分表": "牛肉、水、牛肺、牛腎、牛肚、牛肝、鷹嘴豆、紐西蘭綠唇貝、牛骨、DL-蛋氨酸、乾海帶、礦物質（硫酸鎂、鋅氨基酸複合物、錳氨基酸複合物、銅氨基酸複合物）、"
            "牛磺酸、維生素（維生素E、維生素B1、維生素B6、維生素D3、葉酸）。"},
    {"_id": "1_c", "品牌": "Ziwi peak巔峰", "口味": "羊", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "32", "脂肪": "56.4", "碳水": "11.6", "磷含量": "287", "鈣磷比": "1.3:1",
     "是否含膠": "無", "其他": "鷹嘴豆",
     "成分表": "羊肉、水、羊肺、羊腎、羊肝、鷹嘴豆、羊肚、羊心、紐西蘭綠唇貝、"
                "羊骨、DL-蛋氨酸、乾海帶、礦物質（硫酸鎂、鋅氨基酸複合物、錳氨基酸複合物、銅氨基酸複合物）"
                "、牛磺酸、維生素（維生素E、維生素B1、維生素B6、維生素D3、葉酸）。"},
    {"_id": "1_d", "品牌": "Ziwi peak巔峰", "口味": "鹿", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "42.5", "脂肪": "47.7", "碳水": "9.8", "磷含量": "275", "鈣磷比": "1.5:1",
     "是否含膠": "無", "其他": "鷹嘴豆",
     "成分表": "鹿肉、水、鹿肚、鹿肝、鷹嘴豆、鹿肺、鹿心、鹿腎、紐西蘭綠唇貝、鹿骨、DL-蛋氨酸、乾海帶、"
                    "礦物質（硫酸鎂、鋅氨基酸複合物、錳氨基酸複合物、銅氨基酸複合物）、牛磺酸、"
                    "維生素（維生素E、維生素B1、維生素B6、維生素D3、葉酸）。"},
    {"_id": "1_e", "品牌": "Ziwi peak巔峰", "口味": "鯖魚", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "55.7", "脂肪": "33.8", "碳水": "10.4", "磷含量": "409", "鈣磷比": "1.1:1",
     "是否含膠": "無", "其他": "鷹嘴豆",
     "成分表": "紐西蘭野生鯖魚、水、鷹嘴豆、紐西蘭綠唇貝、DL-蛋氨酸、"
                        "礦物質（磷酸二鉀、硫酸鎂、鋅氨基酸複合物、錳氨基酸複合物、銅氨基酸複合物）、乾海帶、"
                        "維生素（氯化膽鹼、維生素E、維生素B1、維生素B3、維生素B6、維生素B2、維生素D3、葉酸）、海鹽、牛磺酸。"},
    {"_id": "1_f", "品牌": "Ziwi peak巔峰", "口味": "鯖魚+羊肉", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "43", "脂肪": "44.7", "碳水": "12.3", "磷含量": "292", "鈣磷比": "1.3:1",
     "是否含膠": "無", "其他": "鷹嘴豆",
     "成分表": "鯖魚、水、羊肉、羊肺、鷹嘴豆、羊肚、羊心、羊腎、羊肝、"
            "紐西蘭綠唇貝、羊骨、DL-蛋氨酸、乾海帶、礦物質（硫酸鎂、鋅氨基酸複合物、錳氨基酸複合物、銅氨基酸複合物）、"
            "牛磺酸、維生素（維生素E、維生素B1、維生素B6、維生素D3、葉酸）。"},
    {"_id": "1_g", "品牌": "Ziwi peak巔峰", "口味": "雞魚+鴨肉", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "34", "脂肪": "63.4", "碳水": "2.6", "磷含量": "267", "鈣磷比": "1.3:1",
     "是否含膠": "無", "成分表": "雞肉、雞肉原湯、鴨肉、鱸魚、雞心、雞肝、全蛋、紐西蘭綠唇貝、乾燥蛋白、火雞、雞脖子、雞骨、鴨骨、"
                         "礦物質(磷酸二鉀、硫酸鎂、鋅胺基酸複合物、鐵胺基酸複合物、錳胺基酸複合物、銅胺基酸複合物)、火雞骨、火雞胗、火雞肝、蛋胺酸、"
                         "維生素(氯化膽鹼、維生素E、維生素B1、維生素B3、維生素B6、維生素B2、維生素D3、葉酸)、有機海帶、火雞心、牛磺酸"},
    {"_id": "1_h", "品牌": "Ziwi peak巔峰", "口味": "雙羊肉", "產地": "紐西蘭", "主食罐/副食罐": "主食罐",
     "蛋白": "31.9", "脂肪": "65.6", "碳水": "2.5", "磷含量": "313", "鈣磷比": "1.4:1",
     "是否含膠": "無" ,
     "成分表": "羊肉、羔羊原湯、山羊、鱸魚、山羊肚、珍鰺、羊肚、羊肺、紐西蘭綠唇貝、羔羊血漿、鯖魚、山羊肝、羔羊骨、羊肝、"
            "卵磷脂、山羊心、羊骨、山羊肺、山羊腎、礦物質(磷酸二鉀、硫酸鎂、鋅胺基酸複合物、鐵胺基酸複合物、錳胺基酸複合物、銅胺基酸複合物)、"
            "蛋胺酸、山羊骨、維生素(氯化膽鹼、維生素E、維生素B1、維生素B3、維生素B6、維生素B2、維生素D3、葉酸) 、有機海帶、牛磺酸"},
    {"_id": "1_i", "品牌": "Ziwi peak巔峰", "口味": "牛肉+鹿肉", "產地": "紐西蘭",
     "蛋白": "32.5", "脂肪": "64.6", "碳水": "3", "磷含量": "264", "鈣磷比": "1.6:1",
     "是否含膠": "無",
     "成分表": "牛肉、牛肉原湯、鹿肉、藍鱈魚、羊肚、牛腎、羊肺、紐西藍綠唇貝、羊血漿、鹿肚、鱈魚、牛肝、鹿肺、牛骨、羊肝、羊腎、羊肉、"
            "卵磷脂、鹿腎、鹿骨、礦物質(磷酸二鉀、硫酸鎂、鋅胺基酸複合物、鐵胺基酸複合物、錳胺基酸複合物、銅胺基酸複合物)、"
            "蛋胺酸、維生素(氯化膽鹼、維生素E、維生素B1、維生素B3、維生素 B6、維生素B2、維生素D3、葉酸) 、有機海帶、羊骨、牛磺酸"}
]

my_find = mycol.find({"_id": {"$regex":"^1"}})
for x in my_find:
    print(x)
